# Tricks about Pandas 1

## Adding New Column from Groupby Results

In [22]:
import pandas as pd

Create a dataframe

In [23]:
df = pd.DataFrame( {'city':['London','London','Berlin','Berlin'], 'rent': [1000, 1400, 800, 1000]} )

In [24]:
df

     city  rent
0  London  1000
1  London  1400
2  Berlin   800
3  Berlin  1000

In [25]:
df['total'] = df.groupby('city').transform('sum')

In [26]:
df

     city  rent  total
0  London  1000   2400
1  London  1400   2400
2  Berlin   800   1800
3  Berlin  1000   1800

In [27]:
df['percent'] = df['rent']/df['total']

In [28]:
df

     city  rent  total   percent
0  London  1000   2400  0.416667
1  London  1400   2400  0.583333
2  Berlin   800   1800  0.444444
3  Berlin  1000   1800  0.555556